# KJ Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KJ Property
SymbolTypeId Class See Also
---
Symbol kJ, indicating unit Kilojoules.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KJ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KJ As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KJ {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace